package by.it.sc04_evening_tue_thu.sushchenja.lesson05;

/*
Напишите программу которая спрашивает у пользователя:
Какую вы хотите зарплату в $$$?

После ввода суммы, программа анализирует полученное значение
и если введенная цифра меньше 300 или больше 3000 программа выводит на экран:
Мы вам перезвоним!

Иначе выводит в цикле по переменной int month от 0 до 14 рассчитанную зарплату.
В летние месяцы - выводится введенная сумма с названием месяца.
В несуществующие месяцы 0, 13 и 14 выводится сумма в $0.0
в остальные месяцы выводится указанная сумма с премией в 50%.

Сделайте так, чтобы в тот месяц, когда получилась зарплата в $666 цикл после вывода прерывался.

Пример работы программы (у вас должно быть так же, до символа):

Какую вы хотите зарплату в $$$?
2000
За месяц 0 начислено $0.0
За январь начислено $3000.0
За февраль начислено $3000.0
За март начислено $3000.0
За апрель начислено $3000.0
За май начислено $3000.0
За июнь начислено $2000.0
За июль начислено $2000.0
За август начислено $2000.0
За сентябрь начислено $3000.0
За октябрь начислено $3000.0
За ноябрь начислено $3000.0
За декабрь начислено $3000.0
За месяц 13 начислено $0.0
За месяц 14 начислено $0.0

*/

import java.util.Scanner;

public class TaskC1 {
    public static void main(String[] args) {
        System.out.println("Какую вы хотите зарплату в $$$?");
        Scanner sc = new Scanner(System.in);
        int a = sc.nextInt();
        double b = 0.0;
        double d = a*1.5;

        if (a<300 || a>3000) {
            System.out.println("Мы вам перезвоним!");
        }
        else {
            double c;
            for (int i = 0; i <=14 ; i++) {
                switch (i) {
                    case 1:
                        c=d;
                        System.out.println("За январь начислено "+"$"+c);
                        break;
                    case 2:
                        c=d;
                        System.out.println("За февраль начислено "+"$"+c);
                        break;
                    case 3:
                        c=d;
                        System.out.println("За март начислено "+"$"+c);
                        break;
                    case 4:
                        c=d;
                        System.out.println("За апрель начислено "+"$"+c);
                        break;
                    case 5:
                        c=d;
                        System.out.println("За май начислено "+"$"+c);
                        break;
                    case 6:
                        c=a;
                        System.out.println("За июнь начислено "+"$"+c);
                        break;
                    case 7:
                        c=a;
                        System.out.println("За июль начислено "+"$"+c);
                        break;
                    case 8:
                        c=a;
                        System.out.println("За август начислено "+"$"+c);
                        break;
                    case 9:
                        c=d;
                        System.out.println("За сентябрь начислено "+"$"+c);
                        break;
                    case 10:
                        c=d;
                        System.out.println("За октябрь начислено "+"$"+c);
                        break;
                    case 11:
                        c=d;
                        System.out.println("За ноябрь начислено "+"$"+c);
                        break;
                    case 12:
                        c=d;
                        System.out.println("За декабрь начислено "+"$"+c);
                        break;
                    default:
                        c=b;
                        System.out.println("За месяц "+i+" начислено $"+c);
                }
                if (c == 666) break;
            }
        }
    }
    }
