package by.it.akhmelev.lesson13;

//напишите три статических метода,
//один метод double sum(double[] salary) - считает сумму всех зарплат.
//второй double[] add(double[] salary, double percent) вычисляет новый массив с надбавкой в percent%.
//третий void sort(double[] salary) сортирует массив salary.

// в методе main
// с консоли вводите заработные платы в массив размером в 12 элементов
// выведите на консоль по очереди:

// неотсортированные зарплаты без надбавок
// сумму без надбавок.
// неотсортированные зарплаты с надбавкой в 20%
// сумму с этой надбавкой.
// отсортированные зарплаты с надбавкой в 50%
// сумму с этой надбавкой.
public class TaskA1 {

}
