package by.it.akhmelev.lesson14;
/*
Создайте класс Car c конструктором и методами:
Car(int speed)      - конструктор должен сохранить скорость в поле speed, например 60
void start()        - метод должен вывести в консоль строку "Автомобиль поехал со скоростью 60 км/ч"
void stop()         - метод должен вывести в консоль строку "Автомобиль остановился"
void beep()         - метод выводит на консоль строку "Автомобиль сигналит: Пи-бип!"
String toString()   - метод возвращает строку "Автомобиль"

Создайте класс Maz, который отличается от машины тем, что
    вместо слова "Машина" везде пишет "Maz"
    не может ехать быстрее, чем 80 км/ч
    метод void beep(), который выводит на консоль строку "Maz сигналит: У-у-у-у!"

Создайте класс Mercedes, который отличается машины тем, что:
    вместо слова "Машина" везде пишет "Mercedes"
    не может ехать быстрее, чем 200 км/ч
    метод void beep(), который выводит на консоль строку "Mercedes сигналит: Фа-фа!"

в методе main создайте массив из трех разных авто со скоростями 60 100 и 150 км/ч,
и для каждой из них в одном общем цикле выполните команды старт, сигнал и стоп.

Ограничения: слова Машина Maz Mercedes должгы быть использованы в коде только один раз как литералы
(т.е. не должны быть перемееной или константой).
*/

public class TaskA1 {
}
